app/controllers/ejercicios_controller.rb

SELECT "ejercicios".* FROM "ejercicios"
---
  def index
    @ejercicios = Ejercicio.all

INSERT INTO "ejercicios" ("nombre", "musculo", "maquina", "repeticiones", "series", "dia", "peso", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @ejercicio = Ejercicio.create!(ejercicio_params)

SELECT  "ejercicios".* FROM "ejercicios" WHERE "ejercicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_ejercicio
    @ejercicio = Ejercicio.find(params[:id])